/**********************************************************************
*文件名：1.0.6.cpp
*
*文件描述：输入一个数n，并随机性地选择是计算1到n的和还是计算1到n的乘积
*
*创建人：凡定坤
*
*时间：2018-7-12
*
*版本号：1.0
*
*修改记录：
**********************************************************************/

/*================================================================
*函数名：add
*
*参数：
*     [int] n :求和数
*功能描述：
*         给出参数n求1加到n的和
*
*返回值：成功int类型，失败报错
*
*抛出异常
*
*作 者：凡定坤 2018-7-12
*================================================================/

/*================================================================
*函数名：fact
*
*参数：
*     [int] n :该数的阶乘
*功能描述：
*         给出参数n求n的阶乘
*
*返回值：成功int类型，失败报错
*
*抛出异常
*
*作 者：凡定坤 2018-7-12
================================================================*/
#include <iostream>
#include<cstdlib>
#include<ctime>
using namespace std;

/*求和函数*/
int add(int);

/*求阶乘函数*/
int fact(int);
int main()
{
    /*产生不同的随机数*/
    srand((unsigned)time(NULL));
    int n;
    int ran_num;
    cin >> n;

    /*能被2整除就求和否者就求阶乘*/
    ran_num = rand() % 2;
    cout << ran_num << endl;
    if (ran_num == 0)
    {
        cout << add(n);
    }
    else
    {
        cout << fact(n);
    }
    return 0;
}

int add(int n)
{
    int sum = 0;
    sum = n * (n+1) / 2;
    return sum;
}

int fact(int n)
{
    int mul = 1;
    for(int i = 1; i <= n; i++)
    {
        mul *= i;
    }
    return mul;
}
