/*********************************************************************
*文件名：1.0.7.cpp
*
*文件描述：写程序打印出12×12乘法表（对齐，格式化输出）。
*
*创建人：凡定坤
*
*时间：2018-7-12
*
*版本号：1.0
*
*修改记录：
*
*********************************************************************/
#include <iostream>
using namespace std;
int main()
{
    /*外层循环控制行数*/
    for (int i = 1; i <= 12; i++)
    {
        /*内层循环用于控制每一行的内容*/
        for (int j = 1; j <= i; j++)
        {
            cout << i << "×" << j << "=" << i * j << " ";
        }
        cout << endl;
    }
    return 0;
}
