/*********************************************************************
*文件名：1.0.8.cpp
*
*文件描述：写程序打印所有的素数（系统最大整数范围内的）。
*
*创建人：凡定坤
*
*时间：2018-7-12
*
*版本号：1.0
*
*修改记录：素数的查找有两种算法，直接整除到n或者整除到n的平方根
*
*********************************************************************/

/*==============================================================
*函数名：prim
*
*参数：
*     [int] x :传值
*功能描述：
*         判断该数是否为素数
*
*返回值：成功true，失败false
*
*抛出异常
*
*作 者：凡定坤 2018-7-12
==============================================================*/
#include <iostream>
#include <cmath>
using namespace std;

/*求素数*/
bool prime(int x)
{
     for (int y = 2; y <= sqrt(x); y++)
     {
         if (x%y == 0)
            return false;
     }
     return true;
}
int main ()
{
    int n;
    int m = 0;
    cin >> n;
    if (n >= 2)
    {
        cout << "2 ";
    }
        /*找出n之前的所有素数*/
    for (int i = 3; i <= n; i++)
    {
        if (prime(i))
        {
            m++;
            cout << i << " ";
        }
        if (m == 10)
        {
            m = 0;
            cout << endl;
        }

    }
    return 0;
}
