/***********************************************************************
*
*文件名：1.0.10.cpp
*
*文件描述：写程序计算。
*
*创建人：凡定坤
*
*时间：2018-7-13
*
*版本号：1.0
*
*修改记录：sum的类型为int，得出的结果为0
*
***********************************************************************/
#include <iostream>
#include <cmath>
using namespace std;
int main()
{
    double sum = 0.0;
    cout << pow(10, 6);
    cout << "-----------" << endl;

    /*求和*/
    for (int k = 1; k <= pow(10, 6); k++)
    {
        sum += pow(-1,k+1) / (2 * k + 1);
    }
    cout << 4.0 * sum << endl;
    return 0;
}
