/**********************************************************************
*
*文件名：1.1.13.cpp
*
*文件描述：写个函数，返回指定数的各位数字的列表
*创建人：凡定坤
*
*时间：2018-7-19
*
*版本号：1.0
*
*修改记录：
*
**********************************************************************/

/*===============================================================
*函数名：number
*
*参数：
*     [string] str : 将输入的数字定义为string数组
*功能描述：输出一个数字各个位上的数字
*
*返回值：无返回值
*
*抛出异常
*
*作 者：凡定坤 2018-7-19
===============================================================*/
#include <iostream>
#include <algorithm>
#include <string>
using namespace std;

/*返回一个数字的各个位置上的数*/
void number (string str);
int main()
{
    string str ;
    cin >> str;

    number(str);
    return 0;
}

void number (string str)
{
    /*获取到当前数组的长度*/
    int length = str.length();
    cout << "总的位数为：" << length << endl;
    for (int i = 0; i < length; i++)
    {
        cout << "第" << i + 1 << "位上的数字为：" << str[i] << endl;
    }
}
